In [2]:
print('hello world ')

hello world

In [3]:
import numpy as np
import pandas as pd

In [4]:
dict1={
    "name":['harry','rohan','shawon'],
    "marks":[92,34,24],
    "city":['rampur','kolkata','new york',]
}

In [5]:
df=pd.DataFrame(dict1)
#its use to basically analyze big data 
#it covert in data frame in

In [6]:
df

     name  marks      city
0   harry     92    rampur
1   rohan     34   kolkata
2  shawon     24  new york

In [7]:
###covert in csv this data frame

In [ ]:
df.to_csv('friends.csv')
#it create a excel shit in this data frame which is given on the index
#with index and column give it 
#it also include index

In [10]:
#we can see without index
df.to_csv('friends_index_false.csv',index=False)

In [12]:
#if the data is so big 
#if we want to see only first 2 row 
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [13]:
#if we want to see 2nd two row
df.tail(2)

     name  marks      city
1   rohan     34   kolkata
2  shawon     24  new york

In [14]:
df.describe()

          marks
count   3.00000
mean   50.00000
std    36.71512
min    24.00000
25%    29.00000
50%    34.00000
75%    63.00000
max    92.00000